---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FixedRotation
source: html/21c79e4f-37d5-68c4-f247-9a61f258a2ba.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FixedRotation Property

"Fixed Rotation"

## Syntax (C#)
```csharp
public static ForgeTypeId FixedRotation { get; }
```